API-інтерфейс Geolocation використовується для визначення географічних даних і обміну цією інфо. Повертає довготу та широту. Наприклал знаємо де є юзер і пропонуємо йому відповідні послуги. Є об'єкт navigator і його свойство geolacation. За допомогою navigator.geolocation можна взнати місцезнаходження юзераю
navigator.geolocation повертає об'єкт Geolocation, що має три методи:
getCurrentPosition() - повертає поточне місцезнаходження пристрою юзера (лише один раз, асинхронно - не чекає відповіді, запит пішов і виконується інщий скрипт)
має 3 аргументи-колбеки: geolocationSuccess, geolocationError, geolocationOptions.
watchPosition() - регулярно слідкує за зміною місцязнаходження пристрою юзера.
clearWatch() - термінує метод watchPosition()


<audio src="<адреса>"></audio>
// або
<audio>
 <source src="<адреса>">
</audio>

autoplay - звук відразу після завантаження сторінки
controls - додає панель керування аудіофайлом
loop - зациклює відтворення
muted - відключає звук
src - шлях де знаходиться файл



autoplay - звук відразу після завантаження сторінки
controls - додає панель керування аудіофайлом
loop - зациклює відтворення
muted - відключає звук
src - шлях де знаходиться файл
<video>
 <source src="<адреса>">
</video>

autoplay
controls
height
loop
poster - адреса заставки допоки завантажеться відео
preload - для завантаження відео із завантаженням веб-сторінки
src
width



<canvas id="<идентификатор>">
</canvas>
область для виводу скриптом рисунків, анімації
width (300px) height (150px)
